# 假设你获取到了2017年内地电影票房前20的电影(列表a)和电影票房数据(列表b),那么如何更加直观的展示该数据?
# 可以使用条形图来表示离散的数据
# x 代表电影名,y 代表票房
from matplotlib import pyplot as plt
a = ['战狼', '速度与激情8', '功夫瑜伽', '西游降妖篇', '变形金刚5:最后的骑士', '摔跤吧!爸爸', '加勒比海盗5:死无对证', '金刚:骷髅岛', '极限特工:终极回归',
     '生化危机6:终章', '乘风破浪', '神偷奶爸3', '智取威虎山', '大闹天兰', '金刚狼3:殊死一战', '蜘蛛侠:英雄归来', '悟空传', '银河护卫队2', '情圣', '新木乃伊']

b = [56.01, 26.94, 17.53, 16.49, 15.45, 12.96, 11.8, 11.61, 11.28, 11.12,
     10.49, 10.3, 8.75, 7.55, 7.32, 6.99, 6.88, 6.86, 6.58, 6.23]  # 单位:亿

plt.figure(figsize=(16, 8), dpi=100)
# 设置可显示中文的字体
plt.rcParams['font.sans-serif'] = ['Arial Unicode MS']

# 绘制条形图
# 要传入数字进去所以需要传range(en(a)),之后在对应字符串就可以了,跟plot和scatter一样
# 使用barh方法,由于条形图是横向的所以原先的width变成了height
plt.barh(range(len(a)), b, height=0.3, color='orange')

# 设置刻度
plt.yticks(range(len(a)), a,)

# 描述信息
plt.xlabel('票房(亿)')
plt.ylabel('电影')
plt.title('2017票房Top20')

# 网格
plt.grid()

# plt.savefig('./movie.png')

plt.show()
